{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Figuring \w+ out",
  "language": "en",
  "home_page_url": "https://blog.christopherlopes.com",
  "feed_url": "https://blog.christopherlopes.com/feed/feed.json",
  "description": "",
  "author": {
    "name": "Christopher Lopes",
    "url": "https://blog.christopherlopes.com/about"
  },
  "items": [{
      "id": "https://blog.christopherlopes.com/posts/2024-03-04-reflections-on-continuous-growth-is-cancer/",
      "url": "https://blog.christopherlopes.com/posts/2024-03-04-reflections-on-continuous-growth-is-cancer/",
      "title": "Reflections on the article: Continuous growth is cancer",
      "content_html": "<p>This morning I read the article <a href=\"https://christianheilmann.com/2023/03/03/continuous-growth-is-cancer/\">Continuous growth is cancer</a>.</p>\n<blockquote>\n<p>Instead of building a sustainable work environment with sensible compensation, the system favours<br>\ncontinuous growth – something that isn't possible in a world of limited resources.</p>\n</blockquote>\n<p>Several aspects of this post resonated with me. I recognize cycles of growth are important and\nnecessary. But it seems to me growth is our primary objective. It makes sense. It's an easy metric\nwhich shows we are succeeding, at least at first look and for the moment. Perhaps it provides\npositive emotions, because the pursuit of growth triggers dopamine. But growth cannot continue\ncontinuously forever. The pursuit of growth is often shortsighted which can lead to detrimental\nconsequences. Cancer in someways in an apt analogy.</p>\n<blockquote>\n<p>This fetish we have for growth is starting to annoy me. If your career doesn't progress every half\nyear, you’re a failure. If your product doesn't double user numbers each quarter, it gets\ncanceled. If you don’t show any interest in advancing up the career ladder, but instead focus on\nyour job, you’ll get asked why that is and pushed into booster processes.</p>\n</blockquote>\n<p>I've been at my current organization as it has more than doubled in size. They have managed growth\nwell. Be there are aspects of who we were which have been lost, which I mourn. It's not the same\nplace. I'm grateful for what the organization has provided me. But I'm also discouraged, saddened\nand frustrated. The organization believes growth is always necessary and always what we should be\npursuing. It supports you in your career, as long as your career is moving up the management ladder,\nwhich I am not interested in. Even though I have done much of the leading which has brought my\ndepartment to where we currently are I am left unrecognized as others pass me by on their pursuit of\n&quot;leadership&quot;. When I inquire about other forms of leadership the only response I receive is sorry,\nwe're not big enough to support other forms of leadership.</p>\n<blockquote>\n<p>Maybe we should grow in our mindfulness and humanity and not only in numbers.</p>\n</blockquote>\n<p>I am left feeling we get our priorities out of wack. Others have been sounding the trumpet about the\nshortsightedness of our culture today. What is the solution to this? Is there a different value\nwhich can guide us? If so what risk and impact must be accepted to follow it? Are we too big to\nchange?</p>\n",
      "date_published": "2023-03-04T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2023-01-29-i-am-a-storyteller/",
      "url": "https://blog.christopherlopes.com/posts/2023-01-29-i-am-a-storyteller/",
      "title": "I am a storyteller",
      "content_html": "<h3 id=\"the-desire\">The desire <a class=\"direct-link\" href=\"#the-desire\">#</a></h3>\n<p>Recently I read a question by someone asking how to become a better storyteller. This question\nresonates with me. I feel I lack the ability to tell a good story. I'm not sure where the desire to\nbe a good storyteller comes from. The place I first identify is to be warmer and more entertaining in\nsocial situations. But I don't know if the desire is to be looked well upon, to soothe my own social\nanxiety, for the benefit of the other, to create a better community, or some other reason.</p>\n<h3 id=\"the-recommendation\">The recommendation <a class=\"direct-link\" href=\"#the-recommendation\">#</a></h3>\n<p>The questioner received several answers. The book <a href=\"https://store.storygrid.com/books/\">Story Grid</a>, along with its associated material.\n<a href=\"https://channel101.fandom.com/wiki/Story_Structure_101:_Super_Basic_Shit\">Dan Harmon's story structure</a> was also recommended. I read through the structure. It provided a\ngood framing for me. It will require practice for me to place stories I tell into this format. But\nhaving a structure provides me confidence in being able to craft a story.</p>\n<p>But of course I need a source for stories I tell. The best way to generate stories is to live a life\nfull of stories. As an introvert my experiences are minimal and not very exciting, so I don't feel\nlike I have a plentiful source.</p>\n<h3 id=\"everyday-is-a-story\">Everyday is a story <a class=\"direct-link\" href=\"#everyday-is-a-story\">#</a></h3>\n<p>Stories, however, I don't think need to be as exciting as what I feel they need to be. Yes, if\nsomething eventful happens the story is more engaging. But we relate to lots of things which happen\nin life. Additionally, I can be creative with my stories. I can make up things which happen,\nsimilar to jokes. Or start from something I observe. Or start from something which happens but then\ncontinue forward in a creative way, how it played out in my head. All of these sources can be\nentertaining and communicate about my perspective, the way I see things, think about things.\nTherefore being creative doesn't mean it's empty sharing. The story still contains meaning. It's\ncommunicating a different aspect.</p>\n<h3 id=\"the-stories-we-tell-ourselves\">The stories we tell ourselves <a class=\"direct-link\" href=\"#the-stories-we-tell-ourselves\">#</a></h3>\n<p>This morning I felt sleepy as I was sitting during church. As we were walking to the car afterwards\nmy wife asked if I was tired. I said I was resting as I was listening. She said I was head bobbing\nduring church.</p>\n<p>As we drove away I felt embarrassed and wondering who else noticed. Along with this feeling I\nstarted thinking why I was sleepy. I began having conversations with others in my head telling them\nwhy I was sleepy and so why it was reasonable I was head bobbing.</p>\n<p>It was at this moment I realized I was telling myself a story. I've learned we are constantly telling\nourselves stories. This was a good example on how this plays out in life. It reminds me of the study\nin which the corpus callosum was severed in people who experience seizures in order to prevent\nseizures from occurring. An interesting result was found which has been named the <a href=\"https://en.wikipedia.org/wiki/Left-brain_interpreter\">left-brain\ninterpreter</a>. When the field of vision is restricted between the left and right eyes then if the\nright eye is shown something the left brain will make up what it believes to be a reasonable\nexplanation about the action which occurred.</p>\n<blockquote>\n<p>the left-brain interpreter will nonetheless construct a contrived explanation for the action,\nunaware of the instruction the right brain had received.</p>\n</blockquote>\n<p>It has been determined we all experience this.</p>\n<blockquote>\n<p>The drive to seek explanations and provide interpretations is a general human trait, and the\nleft-brain interpreter can be seen as the glue that attempts to hold the story together, in order\nto provide a sense of coherence to the mind.</p>\n</blockquote>\n<p>It was then I realized that I am already an expert storyteller. My brain is constantly telling\nmyself stories. Believable stories. I am a storyteller. It's not a foreign practice. Therefore\nrelax, trust your instincts and dive in!</p>\n",
      "date_published": "2023-01-29T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2023-01-19-we-teach-failure-is-to-be-feared/",
      "url": "https://blog.christopherlopes.com/posts/2023-01-19-we-teach-failure-is-to-be-feared/",
      "title": "We teach failure is to be feared",
      "content_html": "<h3 id=\"how-fear-of-failure-impacts-me\">How fear of failure impacts me <a class=\"direct-link\" href=\"#how-fear-of-failure-impacts-me\">#</a></h3>\n<p>I've carried the fear of failure for as long as I can remember. There's no area of my life where this fear does not reach. As I've grown older I believe I understand this emotion better. That I can recognize it and understand why I am experiencing it. But it doesn't mean I'm not overcome by it and that it has an undesirable impact in my life.</p>\n<p>One significant area of my life this fear has dominated me has been in school. One positive aspect to this fear is that it motivated me to do well in school. But the negative side of it is that it caused me to focus on what it would take to get the mark. Even though I'm a curious person this part of me was sacrificed at the alter of fear. I don't know if today I'd do much better letting this fear control me. Yet I long to be in an environment where I can be curious and explore. Where the learning process is to be enjoyed.</p>\n<p>Recently I was in a discussion about high school students enrolled in Running Start. Sometimes they complete everything needed to graduate but because of timelines they are still finishing the Running Start classes. But at this point it doesn't matter how they do in the class. It doesn't impact their high school record and it won't impact their college record. When students are in this position they frequently slack off and stop working. I imagine I would have kept working for the grade, out of fear of failure. But I wondered, would I have been able to experience this scenario as freeing? Since the grade would not have had any impact would I have been able to let my curiosity out and finally enjoy the learning process?</p>\n<h3 id=\"how-we-teach-failure-is-to-be-feared\">How we teach failure is to be feared <a class=\"direct-link\" href=\"#how-we-teach-failure-is-to-be-feared\">#</a></h3>\n<p><a href=\"https://freakonomics.com/podcast/is-gaming-good-for-you/\">Episode 76 of the podcast People I Mostly Admire</a> with guest <a href=\"https://en.wikipedia.org/wiki/Jane_McGonigal\">Jane McGonigal</a> of the book <a href=\"https://janemcgonigal.com/my-book/\">SuperBetter</a> compared video games to our educational system. When playing a video game it is okay if you fail because you are able keep trying, playing over and over, as long as you want. But in school you typically have one try. You don't get to retake a test. Relearn the material. This makes for an &quot;overly punitive system&quot; in which instead of embracing and enjoying a challenge we are anxious and fear the failure.</p>\n<p>I could not have finish school soon enough. In university I was offered the opportunity to continue on in graduate school and teach. I was approached be several professors. I dismissed them all immediately. I did not enjoy school. There's so much I lost by not being able to do so.</p>\n<h3 id=\"the-consequences-of-teaching-failure-is-to-be-feared\">The consequences of teaching failure is to be feared <a class=\"direct-link\" href=\"#the-consequences-of-teaching-failure-is-to-be-feared\">#</a></h3>\n<p>It is understandable how we've ended up in a punitive educational system. But because we do operate under such a system what we lose is substantial.</p>\n<p>Fear of failures prevents many of us from starting things, learning things, and receiving correction well. This blog post for example. It is not researched. It is not thought out. Instead I am merely shaping my thoughts as I go. And it makes me wonder, there is failure in this approach. Perhaps if it was thought out and researched it would be more persuasive. That it would present a better impression of myself. But by that reasoning I probably would never write anything because I'd know I could always research it more. Think about it more. Wisdom is in understanding this line.</p>\n<p>But having a society where its people have been taught through fear leads to a society of people who feel bad about themselves. We give up. We focus on the wrong thing. There is a tremendous amount of potential which will never be realized. That is lost.</p>\n<p>Changing the educational system isn't going to happen overnight, but maybe eventually. In the meantime I desire to be the kind of person where I communicate failure differently in the relationships I am, to encourage others to keep trying instead of fearing. To enjoy taking on hard things and challenged by failure, instead of being anxious and fearing failure.</p>\n",
      "date_published": "2023-01-19T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2023-01-16-devcontainers/",
      "url": "https://blog.christopherlopes.com/posts/2023-01-16-devcontainers/",
      "title": "Using devcontainers with VS Code and GitHub Codespaces",
      "content_html": "<h3 id=\"the-beginning%3A-creating-a-blazor-wasm-application-on-both-windows-and-linux\">The beginning: Creating a Blazor WASM application on both Windows and Linux <a class=\"direct-link\" href=\"#the-beginning%3A-creating-a-blazor-wasm-application-on-both-windows-and-linux\">#</a></h3>\n<p>I use a Windows machine at work but a Linux machine at home. I do .Net development at work.\nAlthough I'd prefer to development in a different ecosystem at home it is still helpful to be\nable to experiment and do some .Net development at home. In theory this should now be possible.\nHowever I always seem to run into issues.</p>\n<p>As part of my learning related to work I decided to create a simple shopping list application using\nan <a href=\"https://learn.microsoft.com/en-us/azure/static-web-apps\">Azure Static Website Application</a>, SWA. I've also wanted to try out WASM, so off I went starting my project.</p>\n<h3 id=\"how-to-create-the-project-and-the-azure-resources\">How to create the project and the Azure resources <a class=\"direct-link\" href=\"#how-to-create-the-project-and-the-azure-resources\">#</a></h3>\n<p>I also was interested in learning how to integrate the <a href=\"https://learn.microsoft.com/en-us/azure/developer/azure-developer-cli/\">Azure Developer CLI</a> (azd). There currently isn't a\ntemplate to start from for the project type I wanted to create. Therefore I started out <a href=\"https://github.com/Azure-Samples/todo-csharp-sql-swa-func\">azd C#\nStatic Web App template</a> to learn from. When I tried provisioning Azure resources stating a\nresource was not available in the region I selected. But it did not report which resource it was!\nThankfully I had recently tried deploying an Azure SQL DB recently and remembered it was not\navailable in the region I normally use. I selected a different region and tried again. Same type of\nfailure. I was able to eventually determine which other resource it was not happy with in the region\nI selected. Finally I was able to successfully provision Azure resources. But a couple days later I\nrealized I should have looked at the resources the template was creating because the Azure SQL DB\nquickly spent all of my credits and locked my account.</p>\n<p>I did not give up. I pushed forward and went through the process of customizing the template for my\nproject. There's a lot in these templates however. So the process took time as I tried to simplify\nthe template for my project. It was an error prone and lengthy process. Thankfully I never felt\ncompletely stuck and so was able to finally provision all of the resources.</p>\n<p>I started my Blazor WASM project from the <a href=\"https://github.com/staticwebdev/blazor-starter\">Blazor Starter template</a>. However when I tried to deploy\nthe application it failed. The resolution was not obvious. Perhaps WASM is not supported by azd for\nSWA's. I was exhausted. At this point I just wanted something which worked.</p>\n<p>SWA's have their own CLI. It's a convenient way to create, develop and deploy SWAs. Therefore I next\ntried this route. However I immediately ran into errors. I don't remember what they were. I didn't\nspend time attempting to figure it out.</p>\n<p>As a final fallback I used the built in GitHub Actions to deploy the SWA. Thankfully this worked\nwithout issue. Yay!</p>\n<h3 id=\"pulled-in-again-with-dev-containers\">Pulled in again with Dev Containers <a class=\"direct-link\" href=\"#pulled-in-again-with-dev-containers\">#</a></h3>\n<p>Azd is still in beta. A recent update included azd usage from <a href=\"https://devblogs.microsoft.com/azure-sdk/azure-developer-cli-azd-january-2023-release/#use-the-azure-developer-cli-in-github-codespaces\">within GitHub Codespaces</a>, which uses\n<a href=\"https://containers.dev/\">Dev Containers</a>. I was familiar with the usage of Dev Containers with VS Code but had never used\nthem before. I figure now was a great time incorporate them.</p>\n<p>But how to begin? There's a <a href=\"https://code.visualstudio.com/docs/devcontainers/devcontainer-cli\">Dev Container CLI</a>. Yikes! That's more than I wanted to dig into.\nThere must be a simpler way to get going. How about a template to work from? This looks like a\nsimple <a href=\"https://github.com/microsoft/vscode-remote-try-dotnet/blob/main/.devcontainer/devcontainer.json\">Dev Container Template</a>. I started out with it, and added in my VS Code extensions, which\nwas what I thought would be the primary benefit of setting up a Dev Container.</p>\n<p>I was able to launch a Codespace. But VS Code was recommending extensions which I thought I had\nalready specified. Unfortunately I had a couple typos and I didn't notice any messages indicating\nthis. I was able to figure out the issue. Extensions installed!</p>\n<p>Except, the <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.blazorwasm-companion\">Blazor WASM Debugging extension</a>. It reports it cannot be used in a Dev Container. Sigh.</p>\n<p>And wait, azd is not installed in the container. I watched the video embedded in the azd\nannouncement, saw the template they were using for the demo, and examined their Dev Container\nconfiguration. They use a Dockerfile and specify several images in their configuration. I guess it's\ngoing to be more complicated than I had hoped. Well, at least now I have another example template\nto work from.</p>\n<p>The changes required were not significant and I was up and running soon. First step, logging in. My\nuser name is the same between my enterprise work and MSDN work accounts. Try as I may I cannot\nlog into the MSDN account. It turns out the <a href=\"https://github.com/Azure/azure-dev/releases/tag/azure-dev-cli_0.5.0-beta.2\">new version of azd introduced this bug</a>. I wonder what\nversion is installed in the Dev Container. The timing of the report of the bug and its resolution\nworked out for me. A fix was quickly in place for me to use. But now I can login but it doesn't know\nabout my Azure subscription. <a href=\"https://github.com/Azure/azure-dev/issues/1398\">A new issue has already been created</a></p>\n<h3 id=\"local-dev-container-usage\">Local Dev Container usage <a class=\"direct-link\" href=\"#local-dev-container-usage\">#</a></h3>\n<p>Now every time I start up VS Code it asks if I want to open the project in the Dev Container. That's\nsort of annoying. How can I always just open it in the Dev Container? After looking around the Dev\nContainer should have an <em>open</em> command. But I don't see that command. There are GitHub issues\nabout this command is missing after an update.</p>\n<p>On a whim I uninstalled the Dev Container CLI and instead installed the tool through VS Code and\nadded the path to the tool in my shell profile. This version does have the <em>open</em> command. I'm\ncalling it good.</p>\n<h3 id=\"conclusion\">Conclusion <a class=\"direct-link\" href=\"#conclusion\">#</a></h3>\n<p>It feels like it has been a long journey. Longer than it should have been. When things follow the\npredetermined path then they work great out of the box. But if you need something different then\nprepared to figure things out as you go. It is in beta. And this is all part of the learning\nprocess.</p>\n<p>Now I need to try develop using the Dev Container and determine if this process provides added\nvalue, hopefully making it more seamless to develop in Linux and across platforms: Linux, Windows\nand Codespaces.</p>\n",
      "date_published": "2023-01-16T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-11-21-the-core-of-what-it-is-to-love-someone/",
      "url": "https://blog.christopherlopes.com/posts/2021-11-21-the-core-of-what-it-is-to-love-someone/",
      "title": "The core of what it is to love someone",
      "content_html": "<h3 id=\"the-excerpt\">The excerpt <a class=\"direct-link\" href=\"#the-excerpt\">#</a></h3>\n<p>An excerpt from <a href=\"https://youtu.be/DLg2Q0daphE?t=2700\">Jordan Peterson's interview with John Vervaeke</a>:</p>\n<blockquote>\n<p>The goal of Rhineland Mysticism was this kind of receptivity, you have to make a space so that the son of God can be born within you. And again, not to be irreligious, but for me to to love my partner is to cultivate that kind of receptivity, a space in which she can be within me, and I don't mean in any purely romantic metaphorical sense. What I mean is she finds a purchase within me whereby she can realize herself, in both senses of the word realize. And she can come to trust that that space that place of realization will always be available for her. And she can come to rely on it. A place which she can transcend herself when she needs to. And being committed to that and finding that inseparably bound up with my own project of trying to realize who I am. That's for me the core of what it is to love somebody.</p>\n</blockquote>\n<p>I'll let the excerpt stand for itself, the link to the interview is provided to for those who desire\nto learn more about the excerpt and what more precisely he is expressing.</p>\n<h3 id=\"the-reflection\">The reflection <a class=\"direct-link\" href=\"#the-reflection\">#</a></h3>\n<p>The words <a href=\"https://twitter.com/vervaeke_john\">Vervaeke</a> used to describe the core of love struck me. His articulation of love evoked\na visceral response in me. Poetry. I desire this, both for myself and for my partner. Yes, this is\nwhat it means to love someone. Well, it is one expression of it. A sacred, safe, trusted place\nwithin myself for another. Bound up forever together as we journey, to learn about ourself, about\nourselves. I need that. I want to provide that. A vow to make. A commitment to each other. A north\nstar to guide our relationship as we wander, get off track, and find our way back. By the grace of\nGod may I. May we.</p>\n<h3 id=\"back-to-where-it-started\">Back to where it started <a class=\"direct-link\" href=\"#back-to-where-it-started\">#</a></h3>\n<p>Vervaeke is borrowing language describing our relationship with God. Space within us so that the son\nof God is born within us. After concluding the previous section, where I invoke the grace of God, my\nthoughts are only complete by circling back and noting this space we allow in us seems contingent on\nus first having this space in us which God can take hold and grow, so that his grace works out of us\nfrom within. I don't know how else we will be able to trust and maintain safe spaces while we do\ncome to know ourselves and each other. To have a space within us where another is able to reside in\nsome ways seems like a organ transplant. It is only with medication our body will not reject the new\norgan. It is with the grace of God I will not reject another as I maintain a space with myself for\nthem.</p>\n<p>By the grace of God</p>\n",
      "date_published": "2021-11-21T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-11-13-computer-backups/",
      "url": "https://blog.christopherlopes.com/posts/2021-11-13-computer-backups/",
      "title": "Computer backups",
      "content_html": "<h3 id=\"neglect\">Neglect <a class=\"direct-link\" href=\"#neglect\">#</a></h3>\n<p>I saw the topic of backups come up again on Hacker News. A couple years ago I set up both Duplicacy\nand Restic. I was going to run both and then compare them. Instead of setting up a schedule I would\nrun a script to kick off the backups. I don't remember the details but I found Duplicacy easier to\nkeep up with so I dropped running Restic fairly quick. I don't remember how long I kept up with the\nbackups run by Duplicacy but it fail by the wayside at some point. At this point I don't even\nremember how I was running them. Considering all of this of course I decided to start all over. This\ntime I decided to try <a href=\"https://kopia.io/\">Kopia</a>, foolishly believing a new tool will of course fix my issues of\nneglecting backups.</p>\n<h3 id=\"getting-started\">Getting started <a class=\"direct-link\" href=\"#getting-started\">#</a></h3>\n<p>Installation was simple in Arch: <code>yay -S kopia</code>. There are a number of go modules which are\ndownloaded. I did not see a package for the KopiaUI which was disappointing because I was going for\neasy. But the CLI is preferable anyway.</p>\n<p>I followed their Getting Started guide. The first example is using the file system. Probably the\nsimplest use case, so let's try it.</p>\n<pre><code>kopia repository create filesystem --path /home/my-user/kopia-backup\nkopia snapshot create ~/Documents\n</code></pre>\n<p>It prompted for a password when creating the repository and then quickly created the snapshot.\nSimple indeed. Let's take a look at the snapshot.</p>\n<pre><code>kopia snapshot list\n</code></pre>\n<h3 id=\"policies\">Policies <a class=\"direct-link\" href=\"#policies\">#</a></h3>\n<p>I think I want to change some of those policies, like which files to ignore. Let's take a look at\nthe current default policies.</p>\n<pre><code>kopia policy show --global\n</code></pre>\n<p>First up, lets ignore some directories.</p>\n<pre><code>kopia policy set --add-ignore .node_modules/ --global\nkopia policy set --add-ignore .git/ --global\nkopia policy show --global\n</code></pre>\n<p>Excellent! I'm was thinking about changing the retention policies but perhaps it's better to keep\nthe defaults for now, at least on the file system repository. But for reference the command to\nchange the policy is simple to use.</p>\n<pre><code>kopia policy set --keep-monthly 10 --global\n</code></pre>\n<p>My preference is to use compression though. Maybe not so important for the file system repository\nbut a feature it will be helpful to try out, hopefully it will help verify I won't have issues\nrunning it on other repositories. The documentation recommends running a benchmark to help determine\nwhich algorithm to use. I tried running the benchmark on a couple files.</p>\n<pre><code>kopia benchmark compression --data-file=book.pdf\nkopia benchmark compression --data-file=data.csv\n</code></pre>\n<p>Not much difference in the algorithms for those files. And unsurprisingly it didn't help the PDF.\nThe CSV isn't very large so not much benefit there either. Oh well, I'll still turn it on and pick\nan algorithm.</p>\n<pre><code>kopia policy set --compression=pgzip --global\n</code></pre>\n<p>After enabling it and creating a new snapshot you can view the stats of the snapshot.</p>\n<pre><code>kopia content stats\n</code></pre>\n<blockquote>\n<p>compression 1.3%</p>\n</blockquote>\n<h3 id=\"scheduling-%F0%9F%93%85\">Scheduling 📅 <a class=\"direct-link\" href=\"#scheduling-%F0%9F%93%85\">#</a></h3>\n<p>Okay, well let's put the backups on a schedule so they don't get neglected this time. On Arch one\noption is to use <code>systemd-run</code> to run jobs. I'll create a little script to run all snapshots.</p>\n<pre><code>echo '#!/bin/sh\\nkopia snapshot create --all' &gt;&gt; ~/.bin/kopia-backup.sh\nchmod +x ~/.bin/kopia-backup.sh\n</code></pre>\n<p>Then I'll add an entry to run the script hourly.</p>\n<pre><code>systemd-run --user --on-calendar=hourly ~/.bin/kopia-backup.sh\nsystemctl list-timers\n</code></pre>\n<h3 id=\"backblaze\">Backblaze <a class=\"direct-link\" href=\"#backblaze\">#</a></h3>\n<p>I have an old Backblaze bucket I was using for backups. I'll repurpose it for the Kopia backups.\nI'll use environment variables for the Backblaze bucket ID and Key so I can store them elsewhere.</p>\n<pre><code>export B2_KEY_ID=MY-APPLICATION-ID\nexport B2_KEY=MY-APPLICATION-KEY\nkopia repository create b2 --bucket=tCarbon\n</code></pre>\n<p>Policies do need to be set up for this repository as well.</p>\n<pre><code>kopia policy set --add-ignore .node_modules/ --global\nkopia policy set --add-ignore .git/ --global\nkopia policy set --compression=pgzip --global\n</code></pre>\n<p>Great! And now we can start creating snapshots for this repository.</p>\n<pre><code>kopia snapshot create ~/Documents\n</code></pre>\n<h3 id=\"switching-repositories\">Switching repositories <a class=\"direct-link\" href=\"#switching-repositories\">#</a></h3>\n<p>If multiple repositories are being used then you need to switch to the appropriate repository before\ntaking the snapshot. The command to switch back and forth is the same as the initial command when\ncreating the repository except the command is <code>connect</code> instead of <code>create</code>.</p>\n<pre><code>kopia repository connect filesystem --path /home/ciwchris/kopia-backup\nkopia repository connect b2 --bucket=tCarbon\n</code></pre>\n<h3 id=\"password-management\">Password management <a class=\"direct-link\" href=\"#password-management\">#</a></h3>\n<p>The password for the repository will need to be entered when connecting. To provide the password\nsecurely in the script I'm using <a href=\"https://www.passwordstore.org/\">pass</a>. To configure pass I followed <a href=\"https://gist.github.com/flbuddymooreiv/a4f24da7e0c3552942ff\">steps in flbuddymooreiv's\ngist</a>.</p>\n<ul>\n<li>Generate a key to use <code>gpg --gen-key</code></li>\n<li>Retrieve the public key <code>gpg --list-keys</code></li>\n<li>Use the public key to initialize pass: <code>pass init xxxxxxxxxxx</code></li>\n<li>Add Git support to pass: <code>pass git init</code>\n<ul>\n<li>Git support can be handy when adding a remote repo which then can be shared between devices</li>\n</ul>\n</li>\n<li>Create a password for kopia: <code>pass insert kopia/filesystem</code></li>\n</ul>\n<p>The backup script can now be modified to insert the password when connecting to the repository. When\nthe password is accessed a prompt will be displayed to unlock pass. Once the password for pass has\nbeen entered the password will be retrieved and used in the script to connect to the repository.</p>\n<pre><code>#!/bin/sh\n\nkopia repository connect filesystem --path /home/ciwchris/kopia-backup -p &quot;$(pass kopia/filesystem)&quot;\nkopia snapshot create --all\n</code></pre>\n<p>Similar steps can be followed to supply the password for connecting to the Backblaze repository as\nwell as the Backblaze bucket id and key.</p>\n<p>That's it for now. Happy backups! 🤞</p>\n",
      "date_published": "2021-11-13T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-06-my-approach-for-writing-and-managing-notes/",
      "url": "https://blog.christopherlopes.com/posts/2021-06-my-approach-for-writing-and-managing-notes/",
      "title": "My approach for writing and managing notes",
      "content_html": "<h3 id=\"the-issue\">The issue <a class=\"direct-link\" href=\"#the-issue\">#</a></h3>\n<p>I love the idea of notes. A place to collect all the interesting bits of information which I come in contact with and which flow through my mind. But recording, tracking and sharing them has always become an obstacle. I've tried numerous system which I end up using for a short period of time but after the initial excitement is gone a lack of motivation sets in to continue to follow the process of managing and sharing them.</p>\n<h3 id=\"what-to-do-about-this\">What to do about this <a class=\"direct-link\" href=\"#what-to-do-about-this\">#</a></h3>\n<p>Reflecting on this behavior my takeaway was to keep my notes and process as simple as possible. For me this meant creating a text file on each device. When I come across something interesting I open up my <code>everything.md</code> file in the text editor of choice and add a date for the beginning of the week, if one hasn't already been recorded, and then paste in the link, text or type out the thought prefixed with tag(s) delineated by colons as demonstrated in this example:</p>\n<pre><code>Date: 6/13\n\n:shopping:reviews:recommendations: https://news.ycombinator.com/item?id=27219759\n:motivation:range:generalist:specialist:\n    - https://www.outsideonline.com/2423015/80-20-rule-beginner-mastery-benefits\n    - https://www.cell.com/patterns/fulltext/S2666-3899(21)00064-7\n:javascript: https://turriate.com/articles/modern-javascript-everything-you-missed-over-10-years\n:introvert: https://thehustle.co/why-introverts-make-great-leaders/\n:neovim:vim: https://github.com/nvim-telescope/telescope.nvim\n:quote:benjamin:franklin: modest diffidence - https://www.goodreads.com/quotes/7971222-i-retained-only-the-habit-of-expressing-my-self-in\n:powershell:ignore: --%\n:database:testing: https://tsqlt.org/user-guide/quick-start/\n:powershell:git:hook: https://gist.github.com/gowon/a36d7622063bd8567f92342f0462ffc5\n</code></pre>\n<p>I'm not too concerned about the structure of the notes, I want to keep it simple to lessen any friction for recording the information. The only rules I try to follow are including a weekly date, add at least one tag, and always use singular words for tags.</p>\n<p>I've mostly used this system successfully for over a year now.</p>\n<h3 id=\"the-weakness\">The weakness <a class=\"direct-link\" href=\"#the-weakness\">#</a></h3>\n<p>My primary issue with this system is that the notes are spread across different devices: work laptop, personal laptop and personal phone. I've tried several services to be able to share these files across devices. One major limiting factor in doing so is that my work blocks most file syncing services as well as note taking sites. I therefore need something which is simple, accessible, and doesn't require much effort to maintain myself.</p>\n<h3 id=\"current-solution\">Current solution <a class=\"direct-link\" href=\"#current-solution\">#</a></h3>\n<p>We use GitHub at work. I have a personal account. Private repositories are now free. I mostly enjoy git. All of these facts make for a simple and convenient system for managing my notes. The primary drawback for me is that the file content will not be encrypted at rest, but that was true before, when the files were a text file sitting on each device. They are still this. And since we trust GitHub with our code at work I therefore feel fine with my notes also sitting on their servers.</p>\n<p>The next issue is that I use a work GitHub account with my work name and email address. I wanted any commits made from work to not include this information and instead include my personal information. To enable this I am using <a href=\"https://git-scm.com/docs/git-config#_conditional_includes\">git config conditional includes</a>. An example version of my <code>gitconfig</code> contains the following:</p>\n<pre><code>[user]\n  name = My Name\n  email = my.work.name@example.com\n  signingkey = 1234567890abcdef\n[includeIf &quot;gitdir:C:/my/note/folder/&quot;]\n  path = .gitconfig.personal\n</code></pre>\n<p>I then override the <code>user</code> settings in the <code>.gitconfig.personal</code> file.</p>\n<pre><code>[user]\n  name = My Name\n  email = my.personal.name@example.com\n  signingkey =\n</code></pre>\n<p>I shared access to my notes repository with my work GitHub account, and so I am still committing from my work account but at least the information in the commits now contain my personal information. This is still not ideal but is simple and suffices. Maybe eventually I'll do the work to find a simple approach for managing multiple GitHub accounts on a device.</p>\n<p>Next up, how to use GitHub from my phone for cloning the repository and then pulling and pushing commits. I looked at several apps for performing this. Again, I wanted something, so I decided to use <a href=\"https://manichord.com/projects/mgit.html\">mgit</a>. The app generates a ssh key when I then can add as a &quot;Deploy key&quot; to the repository with write access. When using the git protocol for the repository URL in mgit then mgit will use the ssh key it generated to access the repository.</p>\n<p>Success and Success!</p>\n<h3 id=\"potential-issues\">Potential issues <a class=\"direct-link\" href=\"#potential-issues\">#</a></h3>\n<p>I don't intend on committing and pushing up a change to a notes file after every edit. Therefore, I've renamed each file, so they are specific to each device. I therefore can forget to commit any edits for a period of time without worry about any conflicts to resolve when I get around to it. Not committing immediately also means a note I took on a different device may not be present when I need it on another device, but the potential cost of needing to keep them in sync currently outweighs the risk of not having a note available when I need it. If I do experience this scenario I am thinking it will be an infrequent and minor inconvenience, especially since I now work from home, and so have all my devices in near proximity most of the time.</p>\n<p>Have multiple files broken out by device I decided now was a good time to also try breaking up the files by years.</p>\n<pre><code>everything-personal-2021.md\neverything-personal-2020.md\neverything-phone-2021.md\neverything-phone-2021.md\neverything-work-2020.md\neverything-work-2020.md\n</code></pre>\n<p>I have concerns about the benefits in doing this and whether it will be the source of obstacles, primarily ease of searching. But at this point I will already be searching across files, so it is worth a try. It's easy enough to stitch them back together if it becomes an issue.</p>\n",
      "date_published": "2021-06-18T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-06-science-is-peculiar-in-decision-making/",
      "url": "https://blog.christopherlopes.com/posts/2021-06-science-is-peculiar-in-decision-making/",
      "title": "Science is peculiar in decision-making",
      "content_html": "<h3 id=\"the-prompt\">The prompt <a class=\"direct-link\" href=\"#the-prompt\">#</a></h3>\n<p>I struggle to make decisions and therefore whenever coming across material on the topic I take note. Recently I was listening to the <a href=\"https://biologos.org/podcast-episodes/bill-newsome-neuroscience-faith-free-will\">Language of God podcast with Bill Newsome.</a> in which they discussed a paper he wrote in 2010, <a href=\"https://biologos.org/podcast-episodes/bill-newsome-neuroscience-faith-free-will\">Life of science, life of faith.</a> Both the podcast and the paper are interesting and so worth the listen and read.</p>\n<h3 id=\"science-is-peculiar\">Science is peculiar <a class=\"direct-link\" href=\"#science-is-peculiar\">#</a></h3>\n<p>There were two points in particular which stood out to me while listening to the podcast which motivated me to read the paper. The first addresses a question he often receives from his colleague concerning the apparent inconsistent approach between the way he approaches his scientific work and his religious life. In the paper he writes:</p>\n<blockquote>\n<p>Both my colleague and my postdoc were struck by the apparent inconsistency in my adoption of religious beliefs without similarly rigorous standards of proof.</p>\n<p>My reply is that, yes, the modes of thought in the two domains can be quite different. This is one of the genuine points of tension between science and religion. Importantly, however, the mode that predominates in religious life is the normal mode of evaluation and decision-making in the overall context of human experience. The scientific mode, in contrast, is quite peculiar: it is applicable to a rather narrow range of experience and is generally practiced by a rather small community of professionals.</p>\n</blockquote>\n<p>For me this was a moment of enlightenment. I attempt to bring a scientific approach to everything in my life but I struggle greatly to do so. I do not trust my intuition. I do not trust my emotions. I often sink lots of time trying to understand what to think, feel, or do in all areas of my life. I become frustrated and stall out leading to inaction. Looking back on my life this accurately explains how I've arrived at my current spot in life.</p>\n<h3 id=\"the-human-condition\">The human condition <a class=\"direct-link\" href=\"#the-human-condition\">#</a></h3>\n<p>While still dazed by his first point he continued his case by showing how the scentific mode is not the mode we commonly use, or can use, in life.</p>\n<blockquote>\n<p>Simply put, this is the human condition. It is life, and our most consequential decisions in life have little or nothing to do with science. This does not mean that we cannot bring rational analysis to bear on the issues. Thoughtful people reflect carefully on important decisions and try to take into account as much evidence as is reasonably available at all times. Nevertheless, rational analysis rarely compels a particular choice and certainly does not guarantee any particular result.</p>\n</blockquote>\n<p>He had me after describing the problem because it so accurately describes my struggle in life. I was ready to hear how he instead approaches choices during the &quot;normal mode&quot; of life, the vast majority of life. His proposal is that decisions in life are composed of three sources.</p>\n<blockquote>\n<p>These kinds of questions, which we all face routinely, simply do not submit to scientific solutions. We cannot make one choice and see how the experiment comes out, then rewind the tape and make the other choice to determine the outcome in the alternative scenario. Rather, we have a one-time shot at our most important decisions. We are forced to rely on intuition, on experience, on the advice of friends, on precarious projections into the future, and, in the end, on our gut feelings about what is likely to prove &quot;right&quot; in a given situation.</p>\n</blockquote>\n<p>He later sums it up nicely stating &quot;normal mode&quot; choices are:</p>\n<blockquote>\n<p>the blend of intuition, analysis, and hopeful commitment</p>\n</blockquote>\n<h3 id=\"conclusion\">Conclusion <a class=\"direct-link\" href=\"#conclusion\">#</a></h3>\n<p>I've heard about the head, heart, and gut triad before and an aim in life is being able to listen to each. To have the three be able to communicate with each other. I like the manner in which Bill Newsome describes this. I need this lesson repeated often. I found his approach refreshing. It has given me renewed motivation to step into this &quot;human condition&quot;, although I still find I am hesitant to say embrace this &quot;human condition&quot;.</p>\n",
      "date_published": "2021-06-05T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-06-reflections-on-project-management/",
      "url": "https://blog.christopherlopes.com/posts/2021-06-reflections-on-project-management/",
      "title": "Reflections on project management",
      "content_html": "<h3 id=\"the-discussion\">The discussion <a class=\"direct-link\" href=\"#the-discussion\">#</a></h3>\n<p>The saying goes:</p>\n<blockquote>\n<p>If you put 10 economists in a room, you’ll get 11 opinions.</p>\n</blockquote>\n<p>So it seems with project management teams, every team member has their thoughts on how to manage projects. Opinions are plentiful, even amongst team members who share similar roles; although to a lesser extent than those across different roles. Every so often an event will occur or something will be said which once again sparks conversations on how projects should be managed. Much time is then spent discussing everyone's opinions. Often some minimal change will be made, at least temporarily. But nothing really changes. Everyone still thinks the project isn't being run well. People give up and surrender to the reality dysfunction. We do what we can but are secretly bitter, thinking how out of whack things are but accept the current state as being inevitable, as we drift closer and closer to the process becoming a <a href=\"https://en.wikipedia.org/wiki/Bullshit_Jobs\">&quot;Bullshit job.&quot;</a></p>\n<p>I'm on a team which just recently had another round of these conversations. I participated in the discussion by asking questions but kept my opinions to myself. I've succumbed to being jaded with the perspective that I'll mostly have to jump through the hoops others desire. The best hope I have is to try to get through the process as quickly as possible so I can go about the work. This frustrates others on the team because I'm not leading. I willingly contribute but do not step up to volunteer to be the JIRA driver, organizer or retrospective radiator reader, etc.</p>\n<p>In <a href=\"https://en.wikipedia.org/wiki/Christopher_Voss\">Christopher Voss' book Never Split the Difference</a>, which I haven't read, I believe he argues it's better for one party to give way when there are differences because by compromising neither party gets what they want and so are unhappy. But if one let's the other have their way then that person still feels good because they are supporing the other. Is that a solution to the project management dilema? One person gets their way and the rest follow? Maybe it would work. Maybe at times.</p>\n<p>Even if that was an option I wonder if I would take them up on the offer, to volunteer and try implementing my ideal project management vision for the realities of my team. But I find myself hesitant to do so because the probability of my process not being any better is likely. Why take that risk then and face this reality only to lose hope that there is a better way? It's easier to quietly judge from the sideline. But that is not helpful and by doing so I forfeit the right to voice an opinion. It is better to risk, learn, and grow. Here then are my thoughts for the environment my team operates within.</p>\n<h3 id=\"the-environment\">The environment <a class=\"direct-link\" href=\"#the-environment\">#</a></h3>\n<p>We do not have product owners. We do not have anyone to demo to nor perform user acceptance testing. The team receives high level requirements and we are then asked to implement it. We have the ability to ask questions of a business party, but they have their normal job role to perform so interaction is minimal. This limits the possibilities on how the project can be managed.</p>\n<p>Management wants to forecast how long something will take and our progress toward completion. The business user cares about a tool which improves the services they provide. My team wants to know what to build and to build it well.</p>\n<h3 id=\"what-cannot-change\">What cannot change <a class=\"direct-link\" href=\"#what-cannot-change\">#</a></h3>\n<p>The process begins with the business communicating their needs. Mangement determines how their request fits in with the bigger picture of the organization. Negotiations are made between the business and management on what will be delivered and its priority. When the time comes management informs my team of the project we will be working on and what it entails. This portion of the project management process will not change, it is the way the organization functions. Perhaps some day someone in a high level managment position will lead an intiative to structure projects otherwise. But for now this is they way projects operate.</p>\n<h3 id=\"the-proposal\">The proposal <a class=\"direct-link\" href=\"#the-proposal\">#</a></h3>\n<p>The job of my team is to begin breaking down the project into pieces and determine the order of the work. We then start story pointing some of the initial pieces. Implementtation begins once we have initial unknowns discovered, questions answered, spikes completed, etc.</p>\n<p>We select the first small chunk of work. The goal should be 5 to 15 work days, but there isn't a set timebox. It takes however long it takes. Once that work is complete we meet. We then reflect. Original story points and number of days taken are recorded. We review the backlog, add more items, estimate more items. We then determine the next valuable thing and work on that to completion. Reflect, Record. Refine. Repeat.</p>\n<h3 id=\"outcome\">Outcome <a class=\"direct-link\" href=\"#outcome\">#</a></h3>\n<p>Using this system mangement can to some extent forecast based on story points given and effort taken for each chunk of work. The chunks of work completed should still mostly deliver business value, so the business can see the application as it progresses, if they have capacity, and feedback can be recevied, even if it's just a few minutes of sharing.</p>\n<p>Can management achieve the accurate and precise timeline they truly desire? No. Will the business get the ideal application for their needs? No. Will the my team know what they are building which measures up to the quality they desire? No. But we all seem a bit closer to these goals and the process is much more efficient. Additionally this all seems feasible to implement within the currenty structure of the organization.</p>\n<h3 id=\"reflection\">Reflection <a class=\"direct-link\" href=\"#reflection\">#</a></h3>\n<p>I started out by bringing up the idea of not splitting the difference, that maybe it's best to let one person decticate how the project is managed. It is not lost on me that my solution has everyone splitting the difference regarding the outcome of the project. If we truly were not to split the difference what would that look like? My team gets to build the perfect project but never deliver it? Mangement dedicates the timeline but ends up with a buggy product and a burnt out team? The business gets a dedicated dev team catering to their every needs but at great expense? Perhaps what's needed most is acceptance. That the world is messy and we prevail by coming together.</p>\n",
      "date_published": "2021-06-02T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-05-azure-function-logging-with-serilog/",
      "url": "https://blog.christopherlopes.com/posts/2021-05-azure-function-logging-with-serilog/",
      "title": "Logging Azure Function App log entries using Serilog gotchas",
      "content_html": "<h3 id=\"the-problem\">The problem <a class=\"direct-link\" href=\"#the-problem\">#</a></h3>\n<p>Azure Functions are great, except logging configuration is not the same as .Net Core applications and there are a number of ways logging can be configured incorrectly which leads to unexpected behavior. One such scenario I recently experienced was sending the Function App logs to Serilog. This was accomplished in start up using the <code>AddLogging</code> extension method.</p>\n<pre class=\"language-csharp\"><code class=\"language-csharp\">Log<span class=\"token punctuation\">.</span>Logger <span class=\"token operator\">=</span> <span class=\"token keyword\">new</span> <span class=\"token constructor-invocation class-name\">LoggerConfiguration</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">.</span>WriteTo<span class=\"token punctuation\">.</span><span class=\"token function\">Console</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">.</span><span class=\"token function\">CreateLogger</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><br>builder<span class=\"token punctuation\">.</span>Services<br>    <span class=\"token punctuation\">.</span><span class=\"token function\">AddSingleton</span><span class=\"token punctuation\">(</span>Log<span class=\"token punctuation\">.</span>Logger<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">.</span><span class=\"token function\">AddLogging</span><span class=\"token punctuation\">(</span>loggingBuilder <span class=\"token operator\">=></span> loggingBuilder<span class=\"token punctuation\">.</span><span class=\"token function\">AddSerilog</span><span class=\"token punctuation\">(</span><span class=\"token named-parameter punctuation\">dispose</span><span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre>\n<p>This seemingly worked. Maybe. There appeared to be missing log entries at times, they never made it to the sink, so maybe not. This was not investigated further because what we did find was the Function App Information level logging is noisy. We therefore adjusted the log level by updating <code>host.json</code>.</p>\n<pre class=\"language-json\"><code class=\"language-json\"><span class=\"token punctuation\">{</span><br>    <span class=\"token property\">\"logging\"</span><span class=\"token operator\">:</span> <span class=\"token punctuation\">{</span><br>        <span class=\"token property\">\"default\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"Warning\"</span><br>    <span class=\"token punctuation\">}</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>However, this didn't seem to make any impact. Function App Information level logs were still being written to the sink.</p>\n<h3 id=\"the-resolution\">The resolution <a class=\"direct-link\" href=\"#the-resolution\">#</a></h3>\n<p>There is a question similar to the problem we experience posted on <a href=\"https://stackoverflow.com/a/67225369\">Stack Overflow with a helpful answer</a>. The reason is not clear, just hints and warnings about when and how logging is used in start up. Instead of using the <code>AddLogging</code> extension method registering an <code>ILoggerProvider</code> is suggested.</p>\n<pre class=\"language-csharp\"><code class=\"language-csharp\">Log<span class=\"token punctuation\">.</span>Logger <span class=\"token operator\">=</span> <span class=\"token keyword\">new</span> <span class=\"token constructor-invocation class-name\">LoggerConfiguration</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">.</span>WriteTo<span class=\"token punctuation\">.</span><span class=\"token function\">Console</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">.</span><span class=\"token function\">CreateLogger</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><br>builder<span class=\"token punctuation\">.</span>Services<br>    <span class=\"token punctuation\">.</span><span class=\"token function\">AddSingleton</span><span class=\"token punctuation\">(</span>Log<span class=\"token punctuation\">.</span>Logger<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">.</span><span class=\"token generic-method\"><span class=\"token function\">AddSingleton</span><span class=\"token generic class-name\"><span class=\"token punctuation\">&lt;</span>ILoggingProvider<span class=\"token punctuation\">></span></span></span><span class=\"token punctuation\">(</span><span class=\"token keyword\">new</span> <span class=\"token constructor-invocation class-name\">Serilog<span class=\"token punctuation\">.</span>Extensions<span class=\"token punctuation\">.</span>Logging<span class=\"token punctuation\">.</span>SerilogLoggerProvider</span><span class=\"token punctuation\">(</span>Log<span class=\"token punctuation\">.</span>Logger<span class=\"token punctuation\">,</span> <span class=\"token named-parameter punctuation\">dispose</span><span class=\"token punctuation\">:</span><span class=\"token boolean\">true</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre>\n<p>This worked as expected! Thank you <a href=\"https://stackoverflow.com/users/6345585/martin-cerny\">Martin Cerny</a>!</p>\n<h3 id=\"next-problem\">Next problem <a class=\"direct-link\" href=\"#next-problem\">#</a></h3>\n<p>The Function App logging was no longer noisy, but sometimes it is nice to change the log level and receive lower level log entries. How can this be accomplished without deploying a new version of the Function App?</p>\n<h3 id=\"next-solution\">Next solution <a class=\"direct-link\" href=\"#next-solution\">#</a></h3>\n<p>Azure Functions provide a convenient way of <a href=\"https://docs.microsoft.com/en-us/azure/azure-functions/functions-host-json#override-hostjson-values\">overriding values in the host file</a>. We can therefore use this mechanism to change the log level by adding an Application Setting:</p>\n<pre><code>AzureFunctionsJobHost__logging__default: Information\n</code></pre>\n<p>We once again receive Information level events coming from the Function App. The one drawback to this is that the Function App will be restarted when an Application Setting is added or changed.</p>\n",
      "date_published": "2021-05-28T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-05-empathy-through-self-reflection/",
      "url": "https://blog.christopherlopes.com/posts/2021-05-empathy-through-self-reflection/",
      "title": "The path to empathy is self reflection",
      "content_html": "<h3 id=\"story\">Story <a class=\"direct-link\" href=\"#story\">#</a></h3>\n<p>The other night a group I've joined at times was reading through the Bible. I have participated in such groups in the past. This group feels and functions very similarly to the others. It begins with small talk along with beverages. Then an opening prayer to kick things off followed by scripture reading and discussion. Prayer requests and a time of prayer follows. Then small talk resumes again.</p>\n<p>This group is reading through the Gospel of Mark. This night we were looking at chapter 7. It begins with Jesus and his disciples eating with unwashed hands. The religious elite of the day saw this as a major failure and questioned Jesus about it. Jesus let them have it, teaching that the defilement to be most concerned about is what comes from within us.</p>\n<p>The group commented on the story, sharing as you might expect, such as the culture of the day and the failure of the religious to miss the forest for the trees, but never venturing into asking questions of ourselves. What do we hold to which we are concerned is defiling but all the while ignoring what is within us?</p>\n<h3 id=\"reflection\">Reflection <a class=\"direct-link\" href=\"#reflection\">#</a></h3>\n<p>My sense is we are proud of ourselves. That we are beyond those we rail about. Even beyond those other Christian groups. But are we really? It feels we all are the same thing differently. Yes, there are great variances in Christian groups, but we also share similarities, such as being formulaic. I suppose it's natural, only human. But I wonder how closely we compare to those we think ourselves better than. Wash you hands feels the same as read scripture, discuss, pray. But the question of defilement was missed. The question of ourselves is missed. We are those we think we're better than. Anger rises within me. But I also have hope.</p>\n<h3 id=\"proposal\">Proposal <a class=\"direct-link\" href=\"#proposal\">#</a></h3>\n<p>My hope is that when we realize this it will lead us to real empathy. Forgiveness comes more easily when we see how the gap between us has been bridged. Instead of further division it brings unity. The differences between us, between groups, are real but that doesn't mean divisions are the result. And I found that as I was sitting there in that group I felt superior to them because they weren't reflecting on themselves, and they were thinking themselves superior to those in the story. But that was exact same thing I was doing to them. Upon my realization of this the gap I had created between me and that group had been bridged. My self reflection lead to empathy. And so I have hope.</p>\n",
      "date_published": "2021-05-26T00:00:00Z"
    },{
      "id": "https://blog.christopherlopes.com/posts/2021-05-absent-mindedness-automatic-processing/",
      "url": "https://blog.christopherlopes.com/posts/2021-05-absent-mindedness-automatic-processing/",
      "title": "Absent mindedness. Lost in thought. Automatic processing.",
      "content_html": "<h3 id=\"story\">Story <a class=\"direct-link\" href=\"#story\">#</a></h3>\n<p>Driving back from a social engagement with my girlfriend to her house I was reflecting on our time there. We were driving down neighborhood streets in an area I hadn't been previously. When we got to her street I kept going straight, after which she alerted me I missed the turn. This brought about a new set of questions for my mind to consider such as: why didn't recognize her street? How many other things was as oblivious to as I drove that night? What is the threat of danger while thinking? What is she thinking about me that I didn't recognize her street? How much do I care about each of these questions? And so on.</p>\n<p>Back to her place I started to collect my things to head home. I felt I had fewer things than when I arrived, so I started to survey my list of items. I realized why I had fewer items, prepared my dog for leaving and was ready to depart, at which time she asked if I had grabbed the items she picked up for me at Costco earlier that day. No. No I had not.</p>\n<h3 id=\"backstory\">Backstory <a class=\"direct-link\" href=\"#backstory\">#</a></h3>\n<p>I experienced a number of memory misses that day. It felt defeating. Why was this? They seem to occur more frequently these recent years in midlife. I took pride in my memory when I was young. I unfortunately relied on it through my school years to get me through most classes without putting in much effort and learning the material. About two years I started experiencing sleep difficulties. All areas of my life were impacted, including my mind. I began noticing memory issues at that time. While trying to determine the reason for my sleep issues I took a number of psychological in an attempt to better understand how my brain was functioning. The results revealed that in all areas my brain functioned very well, except for my working memory. The results confirmed what I was already thinking. It was a question in my mind whether this decline was due to lack of sleep or a natural occurrence of age.</p>\n<h3 id=\"reflection\">Reflection <a class=\"direct-link\" href=\"#reflection\">#</a></h3>\n<p>Driving home another thought occurred to me. What if these memories issues aren't always issues. Maybe we chalk it up to absent mindedness but that's not really what's going on. Being lost in thought and not devoting your attention to the present surroundings must account for some of this. Someone who spends much time in thought this felt comforting. But I always lived in my head. Perhaps when I was young I was able to devote mental resources to both my internal world and the external world. That I had the mental flexibility to quickly jump back and forth between them. This is perhaps a result of having reduced working memory capabilities. But the more intriguing possibility for apparent absent mindedness is automatic processing. Automatic pilot. As we age has our brain able to shift more everyday items to automatic processing, which has the undesirable consequence of causing us to miss all those little things which are not a part of this processing.</p>\n<h3 id=\"proposal\">Proposal <a class=\"direct-link\" href=\"#proposal\">#</a></h3>\n<p>I listen to a couple neroscience podcasts and have read a couple pop-neroscience books but have not devoted study to the topic. My understanding is that our brains attempt to make its processing efficient. When it faces something new it takes place in one part of the brain, and we need to devote our attention to it. But once we become familiar with the task our brains shift it over to an automatic processing area. And thankfully so! Devoting attention to all the things we've learned in life we would quickly be at our functioning limit. As we age we build up more and more of this automatic routines. But these routines are not perfect. And because we are not focusing our attention things will be missed. Mistakes will be made. Items will be forgotten, therefore maybe our apparent absent mindedness is not a memory issue but an indication of the beauty of our mind. And instead of the feeling of embarrassment and discouragement we can proudly trumpet these experiences show casing the number of routines we have amassed into automatic processing.</p>\n<p><strike>Absent mindedness</strike> Automatic processing</p>\n",
      "date_published": "2021-05-24T00:00:00Z"
    }
  ]
}
